Revit 2027 API
ConduitSizeSettings.AddSize Method
 Inserts a new ConduitSize in to the conduit size settings. The conduit standard name determines the location of the new size in the size table.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddSize(
	string standardName,
	ConduitSize sizeInfo
)
Public Sub AddSize (
	standardName As String,
	sizeInfo As ConduitSize
)
public:
void AddSize(
	String^ standardName,
	ConduitSize^ sizeInfo
)
member AddSize :
        standardName : string *
        sizeInfo : ConduitSize -> unit
Parameters
standardName String
 The conduit standard name.
sizeInfo ConduitSize
 The new ConduitSize to be added.
Exceptions
Exception | Condition
ArgumentException |  The conduit standard name does not exist. -or- The conduit size already exists.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The function is called during iterating the size set.
See Also
Reference
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace